Amiya200/stm32_water_tank/Core/Src/screen.c
  for (int i = 0; i < 4; i++) {
    bool pressed = (HAL_GPIO_ReadPin(switchMap[i].port, switchMap[i].pin) == GPIO_PIN_RESET);

    if (pressed && prev[i]) {
      prev[i] = false;
      pressStart[i] = HAL_GetTick();
    } else if (!pressed && !prev[i]) {
      uint32_t pressDuration = HAL_GetTick() - pressStart[i];
      prev[i] = true;

      /* ---- SW3 ≥3s => "Summer Save" burst ---- */
      if (i == 2 && pressDuration >= 3000UL) {
        ModelHandle_TriggerAuxBurst(30);
        lcd_clear();
        lcd_put_cur(0, 0);
        lcd_send_string("Summer Save 30s");
        lcd_put_cur(1, 0);
        lcd_send_string("Relays 2&3 ON");
        HAL_GPIO_TogglePin(switchMap[i].port, switchMap[i].ledPin);
      }

      /* ---- SW1 ≥2s => System reset ---- */
      else if (i == 0 && pressDuration > 2000UL) {
        ModelHandle_ManualLongPress();
      }

      /* ---- SW4 ≥2s => Back/menu reset ---- */
      else if (i == 3 && pressDuration > 2000UL) {
        menu_reset();
      }

      /* ---- SW2 (SELECT) short vs long ---- */
      /* ---- SW2 (SELECT) short vs long ---- */
      else if (i == 1) {
        /* ========== LONG PRESS (ENABLE/DISABLE) ========== */
        if (pressDuration >= 3000UL) {
          /* TIMER → slot select */
          if (ui == UI_TIMER) {
            ui = UI_TIMER_SLOT_SELECT;
            screenNeedsRefresh = true;
          }

          /* SEARCH ON/OFF */
          else if (ui == UI_SEARCH) {
            if (!searchActive) {
              ModelHandle_StartSearch(
                searchSettings.gapSeconds,
                searchSettings.probeSeconds,
                searchSettings.onHour,
                searchSettings.onMinute,
                searchSettings.offHour,
                searchSettings.offMinute);
            } else {
              ModelHandle_StopSearch();
            }

            screenNeedsRefresh = true;
          }

          /* TWIST ON/OFF */
          else if (ui == UI_TWIST) {
            if (!twistActive) {
              ModelHandle_StartTwist(
                twistSettings.onDurationSeconds,
                twistSettings.offDurationSeconds,
                twistSettings.onHour,
                twistSettings.onMinute,
                twistSettings.offHour,
                twistSettings.offMinute);
            } else {
              ModelHandle_StopTwist();
            }

            screenNeedsRefresh = true;
          }
        }

        /* ========== SHORT PRESS (EDIT MODE) ========== */
        else {
          Screen_HandleButton(switchMap[i].btn);
        }

        HAL_GPIO_TogglePin(switchMap[i].port, switchMap[i].ledPin);
      }

      /* ---- Short press default ---- */
      else {
        HAL_GPIO_TogglePin(switchMap[i].port, switchMap[i].ledPin);
        Screen_HandleButton(switchMap[i].btn);
      }
    }
  }
}


void Screen_HandleButton(UiButton btn) {
  if (btn == BTN_NONE) return;

  refreshInactivityTimer();

  /* ---------------- RESET key ---------------- */
  if (btn == BTN_RESET) {
    menu_reset();
    return;
  }

  /* ---------------- SELECT key ---------------- */
  if (btn == BTN_SELECT) {
    menu_select();
    return;
  }

  /* ---------------- UP / DOWN Editing ---------------- */
  switch (ui) {
    /* ===== TIMER EDIT ===== */
    case UI_TIMER_EDIT_SLOT_ON_H:
      if (btn == BTN_UP && edit_timer_on_h < 23) edit_timer_on_h++;
      if (btn == BTN_DOWN && edit_timer_on_h > 0) edit_timer_on_h--;
      break;

    case UI_TIMER_EDIT_SLOT_ON_M:
      if (btn == BTN_UP && edit_timer_on_m < 59) edit_timer_on_m++;
      if (btn == BTN_DOWN && edit_timer_on_m > 0) edit_timer_on_m--;
      break;

    case UI_TIMER_EDIT_SLOT_OFF_H:
      if (btn == BTN_UP && edit_timer_off_h < 23) edit_timer_off_h++;
      if (btn == BTN_DOWN && edit_timer_off_h > 0) edit_timer_off_h--;
      break;

    case UI_TIMER_EDIT_SLOT_OFF_M:
      if (btn == BTN_UP && edit_timer_off_m < 59) edit_timer_off_m++;
      if (btn == BTN_DOWN && edit_timer_off_m > 0) edit_timer_off_m--;
      break;


    /* ===== SEARCH EXTENDED ===== */
    case UI_SEARCH_EDIT_GAP:
      if (btn == BTN_UP && edit_search_gap_s < 999) edit_search_gap_s++;
      if (btn == BTN_DOWN && edit_search_gap_s > 1) edit_search_gap_s--;
      break;

    case UI_SEARCH_EDIT_DRY:
      if (btn == BTN_UP && edit_search_dry_s < 999) edit_search_dry_s++;
      if (btn == BTN_DOWN && edit_search_dry_s > 1) edit_search_dry_s--;
      break;

    case UI_SEARCH_EDIT_ON_H:
      if (btn == BTN_UP && edit_search_on_h < 23) edit_search_on_h++;
      if (btn == BTN_DOWN && edit_search_on_h > 0) edit_search_on_h--;
      break;

    case UI_SEARCH_EDIT_ON_M:
      if (btn == BTN_UP && edit_search_on_m < 59) edit_search_on_m++;
      if (btn == BTN_DOWN && edit_search_on_m > 0) edit_search_on_m--;
      break;

    case UI_SEARCH_EDIT_OFF_H:
      if (btn == BTN_UP && edit_search_off_h < 23) edit_search_off_h++;
      if (btn == BTN_DOWN && edit_search_off_h > 0) edit_search_off_h--;
      break;

    case UI_SEARCH_EDIT_OFF_M:
      if (btn == BTN_UP && edit_search_off_m < 59) edit_search_off_m++;
      if (btn == BTN_DOWN && edit_search_off_m > 0) edit_search_off_m--;
      break;


    /* ===== COUNTDOWN EDIT ===== */
    case UI_COUNTDOWN_EDIT_MIN:
      if (btn == BTN_UP && edit_countdown_min < 600) edit_countdown_min++;
      if (btn == BTN_DOWN && edit_countdown_min > 1) edit_countdown_min--;
      break;


    /* ===== TWIST EXTENDED ===== */
    case UI_TWIST_EDIT_ON:
      if (btn == BTN_UP && edit_twist_on_s < 999) edit_twist_on_s++;
      if (btn == BTN_DOWN && edit_twist_on_s > 1) edit_twist_on_s--;
      break;

    case UI_TWIST_EDIT_OFF:
      if (btn == BTN_UP && edit_twist_off_s < 999) edit_twist_off_s++;
      if (btn == BTN_DOWN && edit_twist_off_s > 1) edit_twist_off_s--;
      break;

    case UI_TWIST_EDIT_ON_H:
      if (btn == BTN_UP && edit_twist_on_hh < 23) edit_twist_on_hh++;
      if (btn == BTN_DOWN && edit_twist_on_hh > 0) edit_twist_on_hh--;
      break;

    case UI_TWIST_EDIT_ON_M:
      if (btn == BTN_UP && edit_twist_on_mm < 59) edit_twist_on_mm++;
      if (btn == BTN_DOWN && edit_twist_on_mm > 0) edit_twist_on_mm--;
      break;

    case UI_TWIST_EDIT_OFF_H:
      if (btn == BTN_UP && edit_twist_off_hh < 23) edit_twist_off_hh++;
      if (btn == BTN_DOWN && edit_twist_off_hh > 0) edit_twist_off_hh--;
      break;

    case UI_TWIST_EDIT_OFF_M:
      if (btn == BTN_UP && edit_twist_off_mm < 59) edit_twist_off_mm++;
      if (btn == BTN_DOWN && edit_twist_off_mm > 0) edit_twist_off_mm--;
      break;


    /* ===== MENU ===== */
    case UI_MENU:
      if (btn == BTN_UP && menu_idx > 0) menu_idx--;
      if (btn == BTN_DOWN && menu_idx < MAIN_MENU_COUNT - 1) menu_idx++;
      break;

    default:
      break;
  }

  screenNeedsRefresh = true;
}
